Revit 2027 API
XYZ.Item Property
Indexed access to coordinates.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double this[
	int idx
] { get; }
Public ReadOnly Default Property Item (
	idx As Integer
) As Double
	Get
public:
property double default[int idx] {
	double get (int idx);
}
member Item : float with get
Parameters
idx Int32
Use 0 for X, 1 for Y and 2 for Z.
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  Thrown when an attempt is made to access the coordinate with an index that is larger than 2.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace